; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v1 ?v12)
             (pred_7 ?v8 ?v4)
             (pred_5 ?v1 ?v4)
             (pred_3 ?v3 ?v1 )
	     (pred_8 ?v1)
             (pred_4 ?v11)
             (pred_6 ?v8)
             (pred_11 ?v4)
             (pred_1 ?v1)
             (pred_10 ?v8)
             (pred_2 ?v1)
             (pred_9 ))



(:action op_2
:parameters (?v9 ?v7 ?v2 ?v13)
:precondition (and (pred_4 ?v9) (pred_4 ?v7) (pred_6 ?v2) (pred_11 ?v13)
          (pred_12 ?v9 ?v7) (pred_7 ?v2 ?v13)
                   (pred_5 ?v7 ?v13) (pred_8 ?v9) 
                   (pred_1 ?v7) (pred_10 ?v2))
:effect (and  (pred_2 ?v7) (not (pred_1 ?v7))))


(:action op_3
:parameters (?v9 ?v5)
:precondition (and (pred_4 ?v9) (pred_4 ?v5)
               (pred_8 ?v9) (pred_12 ?v9 ?v5) (pred_2 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v9))))

(:action op_4
:parameters (?v9 ?v2)
:precondition (and (pred_4 ?v9) (pred_6 ?v2) 
                  (pred_8 ?v9) (pred_3 ?v2 ?v9) (pred_9 ))
:effect (and (pred_10 ?v2)
   (not (pred_3 ?v2 ?v9)) (not (pred_9 ))))


(:action op_5
:parameters (?v9 ?v6 ?v10)
:precondition (and (pred_4 ?v9) (pred_6 ?v6) (pred_6 ?v10)
                  (pred_8 ?v9) (pred_10 ?v10) (pred_3 ?v6 ?v9))
:effect (and (pred_10 ?v6) (pred_3 ?v10 ?v9)
        (not (pred_10 ?v10)) (not (pred_3 ?v6 ?v9))))

(:action op_1
:parameters (?v9 ?v2)
:precondition (and (pred_4 ?v9) (pred_6 ?v2) 
                  (pred_8 ?v9) (pred_10 ?v2))
:effect (and (pred_9 ) (pred_3 ?v2 ?v9) (not (pred_10 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_13 obj_16 obj_17 obj_10 obj_03 obj_22 obj_06 obj_21 obj_20 obj_18 obj_05 obj_12 obj_15 obj_14 obj_07
    obj_02 obj_09 obj_01
    obj_11 obj_19 obj_04
    )

    (:init
       (pred_9)

       (pred_4 obj_08)
       (pred_4 obj_13)
       (pred_4 obj_16)
       (pred_4 obj_17)
       (pred_4 obj_10)
       (pred_4 obj_03)
       (pred_4 obj_22)
       (pred_4 obj_06)
       (pred_4 obj_21)
       (pred_4 obj_20)
       (pred_4 obj_18)
       (pred_4 obj_05)
       (pred_4 obj_12)
       (pred_4 obj_15)
       (pred_4 obj_14)
       (pred_4 obj_07)
       (pred_11 obj_02)
       (pred_11 obj_09)
       (pred_11 obj_01)
       (pred_6 obj_11)
       (pred_6 obj_19)
       (pred_6 obj_04)

       (pred_12 obj_08 obj_10)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_13 obj_16)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_16 obj_22)
       (pred_12 obj_16 obj_17)
       (pred_12 obj_16 obj_13)
       (pred_12 obj_17 obj_06)
       (pred_12 obj_17 obj_16)
       (pred_12 obj_10 obj_21)
       (pred_12 obj_10 obj_03)
       (pred_12 obj_10 obj_08)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_03 obj_22)
       (pred_12 obj_03 obj_13)
       (pred_12 obj_03 obj_10)
       (pred_12 obj_22 obj_18)
       (pred_12 obj_22 obj_06)
       (pred_12 obj_22 obj_16)
       (pred_12 obj_22 obj_03)
       (pred_12 obj_06 obj_05)
       (pred_12 obj_06 obj_17)
       (pred_12 obj_06 obj_22)
       (pred_12 obj_21 obj_12)
       (pred_12 obj_21 obj_20)
       (pred_12 obj_21 obj_10)
       (pred_12 obj_20 obj_15)
       (pred_12 obj_20 obj_18)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_20 obj_21)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_18 obj_05)
       (pred_12 obj_18 obj_22)
       (pred_12 obj_18 obj_20)
       (pred_12 obj_05 obj_07)
       (pred_12 obj_05 obj_06)
       (pred_12 obj_05 obj_18)
       (pred_12 obj_12 obj_15)
       (pred_12 obj_12 obj_21)
       (pred_12 obj_15 obj_14)
       (pred_12 obj_15 obj_20)
       (pred_12 obj_15 obj_12)
       (pred_12 obj_14 obj_07)
       (pred_12 obj_14 obj_18)
       (pred_12 obj_14 obj_15)
       (pred_12 obj_07 obj_05)
       (pred_12 obj_07 obj_14)
       (pred_1 obj_17)
       (pred_1 obj_10)
       (pred_1 obj_22)
       (pred_5  obj_17 obj_02)
       (pred_5  obj_10 obj_09)
       (pred_5  obj_22 obj_01)
       (pred_2 obj_08)
       (pred_2 obj_13)
       (pred_2 obj_16)
       (pred_2 obj_03)
       (pred_2 obj_06)
       (pred_2 obj_21)
       (pred_2 obj_20)
       (pred_2 obj_18)
       (pred_2 obj_05)
       (pred_2 obj_12)
       (pred_2 obj_15)
       (pred_2 obj_14)
       (pred_2 obj_07)

       (pred_7  obj_11 obj_02)
       (pred_7  obj_19 obj_09)
       (pred_7  obj_04 obj_01)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_04 obj_05)
       (pred_8 obj_07)
    )

    (:goal (and
       (pred_3 obj_19 obj_15)
    ))
(:constraints
  (always (not (pred_8 obj_14)))
)
)

; plan
1. (op_3 obj_07 obj_05)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_05)
   goals met: 0 of 1
2. (op_3 obj_05 obj_18)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_18)
   goals met: 0 of 1
3. (op_3 obj_18 obj_20)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_20)
   goals met: 0 of 1
4. (op_3 obj_20 obj_15)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_15)
   goals met: 0 of 1
5. (op_3 obj_15 obj_12)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_12)
   goals met: 0 of 1
6. (op_4 obj_12 obj_19)
   deleted: (pred_3 obj_19 obj_12) (pred_9)
   added: (pred_10 obj_19)
   goals met: 0 of 1
7. (op_3 obj_12 obj_15)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_15)
   goals met: 0 of 1
8. (op_1 obj_15 obj_19)
   deleted: (pred_10 obj_19)
   added: (pred_9) (pred_3 obj_19 obj_15)
   goals met: 1 of 1
